package com.example.myapplication;

public class QuestionAnswer3 {

    public static String question[] = {
            "Что подразумевает атомарность в критериях тестирования?",
            "Что подразумевает модифицируемость в критериях тестирования?",
            "Что подразумевает возможность отслеживания в критериях тестирования?",

    };

    public static  String choices[][] = {
            {"Разделение блоков кода для тестирования",
                    "Тестирование каждого блока кода отдельно от других",
                    "Описание не делится на мелкие части без потери информации"},
            {"Возможность внесения изменений",
                    "Простота внесения изменений в каждый блок кода",
                    "Изменение программы под требования пользователя",},
            {"Каждое описание имеет особый идентификатор",
                    "Отслеживание после выпуска продукта",
                    "Возможность отслеживать ошибки в коде по идентификатору",}


    };

    public static String correctAnswers[] =  {
        "Описание не делится на мелкие части без потери информации",
        "Простота внесения изменений в каждый блок кода",
                "Каждое описание имеет особый идентификатор"

        };
    }

