package com.example.myapplication;

public class QuestionAnswer2 {

    public static String question[] = {
            "Что представляет собой QC?",
            "Что такое пестицидный парадокс?",
            "Что подразумевает собой <<Исчерпывающие проверки системы недостижимы>>?",

    };

    public static  String choices[][] = {
            {"Анализ результатов тестирования и качества новых версий проекта",
                    "Процесс изучения возможностей по внесению изменений",
                    "Тестирование, проверка тех. Характеристик, оценка рисков и т.д."},
            {"Наличие ошибок даже после всех тестов",
                    "Скопление дефектов разного количества и содержание в различных модулях",
                    "Неспособность тестового сценария находить ошибки при его повторении несколько раз"},
            {"При тестировании всегда будет найдена ошибка",
                    "Постоянное изменение сценариев тестирования",
                    "Физическая невозможность тестирования всех комбинаций вводов и предусловий",}


    };

    public static String correctAnswers[] =  {
        "Анализ результатов тестирования и качества новых версий проекта",
        "Неспособность тестового сценария находить ошибки при его повторении несколько раз",
                "Физическая невозможность тестирования всех комбинаций вводов и предусловий"

        };
    }

