package com.example.myapplication;

public class QuestionAnswer4 {

    public static String question[] = {
            "Что является первым этапом в тестировании?",
            "Что является последним этапом в тестировании?",
            "Что такое стадии разработки ПО?",
            "Что относится к видам тестирования, связаным с изменением?",
            "Как называется тестирование пользовательского интерфейса?",
            "Как подразумевает тест надёжности?",

    };

    public static  String choices[][] = {
            {"Анализ имеющегося продукта",
             "Работа с требованиями",
             "Разработка стратегйи тестирования"},

            {"Создание необходмиой документации",
             "Отладка",
             "Релиз и сопровождение"},

            {"Этапы, которые проходят разработчики до того, как проект станет доступным для пользователей",
             "Стадии разработки сценариев тестов",
             "Этапы написание документации для приложения",},

            {"функциональное тестирование",
             "Нагрузочное тестирование",
             "Дымовое тестирование",},

            {"GUI Тестирование",
             "Работа с требованиями",
             "Проверка работоспособности"},

            {"Работа приложения при максимальной нагрузке",
             "Длительно использование приложения",
             "Проверка установки и настройки приложения"},


    };

    public static String correctAnswers[] =  {
        "Анализ имеющегося продукта",
        "Релиз и сопровождение",
        "Этапы, которые проходят разработчики до того, как проект станет доступным для пользователей",
        "Дымовое тестирование",
        "GUI Testing",
        "Длительно использование приложения",

        };
    }

